# 데이터프레임 행 합치기

In [1]:
import pandas as pd

In [2]:
l1 = [{'name': 'John', 'job': 'teacher'},
      {'name': 'Nate', 'job': 'student'},
      {'name': 'Fred', 'job': 'developer'}]

l2 = [{'name': 'Ed', 'job': 'dentist'},
      {'name': 'Jack', 'job': 'farmer'},
      {'name': 'Ted', 'job': 'designer'}]

l3 = [{'name': 'John', 'job': 'teacher'},
      {'name': 'Nate', 'job': 'student'},
      {'name': 'Jack', 'job': 'developer'}]

l4 = [{'age': 25, 'country': 'U.S'},
      {'age': 30, 'country': 'U.K'},
      {'age': 45, 'country': 'Korea'}]

In [3]:
df1 = pd.DataFrame(l1, columns=['name', 'job'])
df2 = pd.DataFrame(l2, columns=['name', 'job'])

In [4]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [5]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [8]:
result = pd.concat([df1, df2], ignore_index=True)

In [9]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [12]:
result = df1.append(df2, ignore_index=True)  # 지원중단 예정

C:\Users\WIN10\AppData\Local\Temp\ipykernel_17620\2520500702.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  result = df1.append(df2, ignore_index=True)  # 지원중단 예정

In [13]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

# 데이터프레임 열 합치기

In [14]:
df3 = pd.DataFrame(l3, columns=['name', 'job'])
df4 = pd.DataFrame(l4, columns=['age', 'country'])

In [15]:
df3

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [16]:
df4

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [23]:
result = pd.concat([df3, df4], axis=1)

In [24]:
result

   name        job  age country
0  John    teacher   25     U.S
1  Nate    student   30     U.K
2  Jack  developer   45   Korea

# 리스트 합치기

In [25]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [26]:
comparison = pd.DataFrame({'label': label, 'prediction': prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4